local-load-test.yml
config:
  target: http://192.168.106.2:3000
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Basic load test
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          - get:
              url: '/recipes'
        count: 100